# **GUJARAT UNIVERSITY**

## MSc IT. Data Management and Visual Insights (5 Years Intigrated)

### INTERNAL EXAMINATIONS

### Semester-V (Sept 2023)

### Subject Name: *Data Analytics Programming Language*                
### Code: DMVIBSC25
### Time: 90 min
#### Max marks: 30

**Instructions**

 - 1) Download the required Packages according to need
 - 2) Rename the file before submission as "EnrollmentNo_Student_Name_DataSem5_DAPL"

## Set A. 15 Marks

**1. Import the Required Libraries (1 Marks)**

**Load the dataset**

In [1]:
# Import numpy
import numpy as np

# Import pandas 
import pandas as pd

# Import Seaborn
import seaborn as sns

# Import matplotlib
import matplotlib.pyplot as plt

Super_Store = pd.read_excel('Superstore Data.xlsx')

**2. Show the top 15 Observations (1 Marks)**

In [2]:
# Code here
Super_Store.head(15)

,State,Segment,Region,Ship Mode,Sales,Quantity,Discount,Profit
0,Kentucky,Consumer,South,Second Class,261.9600,2.0,0.00,41.9136
1,Kentucky,Consumer,South,Second Class,731.9400,3.0,0.00,219.5820
2,California,Corporate,West,Second Class,14.6200,2.0,0.00,6.8714
3,Florida,Consumer,South,Standard Class,957.5775,5.0,0.45,-383.0310
4,Florida,Consumer,South,Standard Class,22.3680,2.0,0.20,2.5164
5,California,Consumer,West,Standard Class,48.8600,7.0,0.00,14.1694
6,California,Consumer,West,Standard Class,7.2800,4.0,0.00,1.9656
7,California,Consumer,West,Standard Class,907.1520,6.0,0.20,90.7152
8,California,Consumer,West,Standard Class,18.5040,3.0,0.20,5.7825
9,California,Consumer,West,Standard Class,114.9000,5.0,0.00,34.4700
10,California,Consumer,West,Standard Class,1706.1840,9.0,0.20,85.3092
11,California,Consumer,West,Standard Class,911.4240,4.0,0.20,68.3568
12,North Carolina,Consumer,South,Standard Class,15.5520,3.0,0.20,5.4432
13,Washington,Consumer,West,Standard Class,407.9760,3.0,0.20,132.5922
14,Texas,Home Office,Central,Standard Class,68.8100,5.0,0.80,-123.8580

**3. Show the bottom most 15 observations (1 Marks)**

In [3]:
# Code here
Super_Store.tail(15)

,State,Segment,Region,Ship Mode,Sales,Quantity,Discount,Profit
1483,Tennessee,Consumer,South,Second Class,3.424,1.0,0.2,1.0700
1484,Washington,Corporate,West,Standard Class,177.000,3.0,0.0,30.0900
1485,New York,Consumer,East,Standard Class,3.760,2.0,0.0,1.3160
1486,California,Home Office,West,Standard Class,1212.848,7.0,0.2,106.1242
1487,California,Home Office,West,Standard Class,89.970,3.0,0.0,37.7874
1488,California,Home Office,West,Standard Class,42.600,3.0,0.0,16.6140
1489,Pennsylvania,Consumer,East,Standard Class,5.040,2.0,0.2,1.7640
1490,New York,Corporate,East,Second Class,62.960,4.0,0.0,28.3320
1491,New York,Corporate,East,Standard Class,5.880,1.0,0.0,2.8812
1492,New York,Corporate,East,NaN,977.292,6.0,0.1,173.7408
1493,Washington,Corporate,West,Standard Class,9.640,2.0,0.0,3.6632
1494,Georgia,Consumer,South,Second Class,40.050,3.0,0.0,11.2140
1495,Texas,Consumer,Central,Standard Class,10.192,7.0,0.2,3.1850
1496,Texas,Consumer,Central,Standard Class,16.784,1.0,0.2,-0.2098
1497,Texas,Consumer,Central,NaN,13.120,5.0,0.2,3.7720

**4. Show the shape of the data (1 Marks)**

In [4]:
# Code here
Super_Store.shape

(1498, 8)

**5. Describe the Dataset and Write the summary (2 Marks)**

In [5]:
# Code here
Super_Store.describe().T

,count,mean,std,min,25%,50%,75%,max
Sales,1468.0,4.541558e+06,1.478510e+08,1.0800,17.11200,53.0580,210.1925,5.555556e+09
Quantity,1491.0,2.236382e+12,6.432607e+13,1.0000,2.00000,3.0000,5.0000,2.222222e+15
Discount,1495.0,1.604548e-01,2.088803e-01,0.0000,0.00000,0.2000,0.2000,8.000000e-01
Profit,1495.0,2.144198e+01,2.109546e+02,-3839.9904,1.71255,8.4888,28.1372,3.177475e+03

**Inference**
- We have found out count, mean, standard deviation, minimum, Q1, Q2, Q3 and maximum values of the observations

**6. Take information of the data and write the summary (2 Marks)**

In [6]:
# First, let's see the attributes(column fields) of the Super Store Dataset
Super_Store.columns

Index(['State', 'Segment', 'Region', 'Ship Mode', 'Sales', 'Quantity',
       'Discount', 'Profit'],
      dtype='object')

**Inference**
- This data set has the following attributes
1. State
2. Segment
3. Region
4. Ship Mode
5. Sales
6. Quantity
7. Discount
8. Profit

In [7]:
# Second, Let's see the data types of the atrributes
Super_Store.dtypes

State         object
Segment       object
Region        object
Ship Mode     object
Sales        float64
Quantity     float64
Discount     float64
Profit       float64
dtype: object

**Inference**
- Here, all the atrributes has correct datatypes

**7. Show the distribution of all numirical veriables (3 Marks)**

In [8]:
Super_Store_Numerical_Distribution = Super_Store[["Sales","Quantity","Discount","Profit"]]

In [9]:
Super_Store_Numerical_Distribution.head()

      Sales  Quantity  Discount    Profit
0  261.9600       2.0      0.00   41.9136
1  731.9400       3.0      0.00  219.5820
2   14.6200       2.0      0.00    6.8714
3  957.5775       5.0      0.45 -383.0310
4   22.3680       2.0      0.20    2.5164

**8. Write the Information that you drow in above questions (2 Marks)**

**Inferene**
- Here, all the atrributes has correct datatypes
- We have found out count, mean, standard deviation, minimum, Q1, Q2, Q3 and maximum values of the observations
- Also there are some null values

**9. Which are the considerations are there that we need to take care before start the analysis (2 Marks)**

Before beginning the analysis, it is essential to consider the following factors: 
 
Data Overview 
- Prior  to  commencing  the  analysis,  it  is  crucial  to  have  a  comprehensive 
understanding of each observation in the data.  
- This includes identifying the columns within the dataset and understanding how 
the data observations were generated. 
- This understanding will help determine the domain to which the data belongs. 
 
Basic Statistics: 
a. Quantitative Information: 
- Quantitative information provides insights into the data's characteristics, such 
as its distribution, shape, memory usage, and central tendency.  
- Key  statistics  to  examine  include  Mean,  Median,  Unique  values,  Standard 
Deviation, Minimum, Maximum, and Quartiles. 
 
b. Assumptions of Statistics: 
- When embarking on the analysis, it is essential to adhere to specific rules and 
assumptions. These include: 
- Ensuring that numerical columns exhibit a normal distribution. 
- Verifying  that  categorical  variables  display  a  balanced  distribution  of 
categories. 
- Confirming the absence of heteroscedasticity in the data. 
 
c. Inference from Statistics: 
- Statistics offer various conclusions that can be drawn from the data. Some 
examples include: 
- Assessing the presence of outliers by comparing the Mean and Median. 
- Drawing meaningful insights from statistical analysis to inform decision-making. 
 
 
- By following these considerations and rules, you can conduct a thorough and 
accurate statistical analysis of your data.

## Set B. 15 Marks (Any 5)

**1. Perform the Univariate analysis on the " Quantity " and take the appropreate actions (3 Marks)**

In [19]:
Super_Store_Numerical_Distribution["Quantity"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 1498 entries, 0 to 1497
Series name: Quantity
Non-Null Count  Dtype
--------------  -----
1491 non-null   float64
dtypes: float64(1)
memory usage: 11.8 KB

In [21]:
Super_Store_Numerical_Distribution["Quantity"].describe().T

count    1.491000e+03
mean     2.236382e+12
std      6.432607e+13
min      1.000000e+00
25%      2.000000e+00
50%      3.000000e+00
75%      5.000000e+00
max      2.222222e+15
Name: Quantity, dtype: float64

In [18]:
Super_Store_Numerical_Distribution["Quantity"].isnull().sum()

7

In [22]:
Super_Store_Numerical_Distribution["Quantity"].max()

2222222222222220.0

In [23]:
Super_Store_Numerical_Distribution["Quantity"].min()

1.0

**2. Perform the Univariate analysis on the "Sales " and take the appropreate actions (3 Marks)**

In [30]:
Super_Store_Numerical_Distribution["Sales"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 1498 entries, 0 to 1497
Series name: Sales
Non-Null Count  Dtype
--------------  -----
1468 non-null   float64
dtypes: float64(1)
memory usage: 11.8 KB

In [31]:
Super_Store_Numerical_Distribution["Sales"].describe().T

count    1.468000e+03
mean     4.541558e+06
std      1.478510e+08
min      1.080000e+00
25%      1.711200e+01
50%      5.305800e+01
75%      2.101925e+02
max      5.555556e+09
Name: Sales, dtype: float64

In [34]:
Super_Store_Numerical_Distribution["Sales"].isnull().sum()

30

In [32]:
Super_Store_Numerical_Distribution["Sales"].max()

5555555555.0

In [33]:
Super_Store_Numerical_Distribution["Sales"].min()

1.08

**3. Find weather there is null values is present in the data or not and take appropreate action if needed (3 Marks)**

In [35]:
Super_Store.isnull().sum()

State        75
Segment       5
Region       21
Ship Mode    29
Sales        30
Quantity      7
Discount      3
Profit        3
dtype: int64

In [40]:
Super_Store = Super_Store.dropna()

In [42]:
Super_Store.isnull().sum()

State        0
Segment      0
Region       0
Ship Mode    0
Sales        0
Quantity     0
Discount     0
Profit       0
dtype: int64

**Infernece**

We have remove all the null values observations

**4. Create Series that must contain a. Ten names of your friends b. Ten ages that you prefere age must lies between 46 to 70  c. ten City names (3 Marks)**

In [39]:
import pandas as pd
import random

# Create a list of friend names
friend_names = ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J"]

# Generate a list of ten random ages between 46 and 70
ages = [random.randint(46, 70) for _ in range(10)]

# Create a list of city names
city_names = ["New York", "Los Angeles", "Chicago", "Houston", "Miami", "San Francisco", "Seattle", "Boston", "Atlanta", "Denver"]

# Create a Pandas Series with the three lists
data = {'Friend Names': friend_names, 'Ages': ages, 'City Names': city_names}
series = pd.DataFrame(data)

# Display the Series
series

  Friend Names  Ages     City Names
0            A    48       New York
1            B    55    Los Angeles
2            C    62        Chicago
3            D    61        Houston
4            E    53          Miami
5            F    62  San Francisco
6            G    59        Seattle
7            H    51         Boston
8            I    51        Atlanta
9            J    56         Denver

**5. Create one Data frame(Df_1) that dataframe must contain 5 columns and 20 Observations, Column names are like "Student_Name, Age, City, Country, email", add the unique observations in those columns.  (3 Marks)**

In [38]:
# Create Series objects
series1 = pd.Series(["A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L","M", "N", "O", "P", "Q", "R", "S", "T"])
series2 = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9 ,10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20])
series3 = pd.Series(["A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L","M", "N", "O", "P", "Q", "R", "S", "T"])
series4 = pd.Series(["A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L","M", "N", "O", "P", "Q", "R", "S", "T"])
series5 = pd.Series(["A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L","M", "N", "O", "P", "Q", "R", "S", "T"])

# Create a DataFrame using the Series objects
DataFrame = pd.DataFrame({
    "Student_Name": series1,
    "Age": series2,
    "City": series3,
    "Country": series4,
    "Email": series5
})

DataFrame

   Student_Name  Age City Country Email
0             A    1    A       A     A
1             B    2    B       B     B
2             C    3    C       C     C
3             D    4    D       D     D
4             E    5    E       E     E
5             F    6    F       F     F
6             G    7    G       G     G
7             H    8    H       H     H
8             I    9    I       I     I
9             J   10    J       J     J
10            K   11    K       K     K
11            L   12    L       L     L
12            M   13    M       M     M
13            N   14    N       N     N
14            O   15    O       O     O
15            P   16    P       P     P
16            Q   17    Q       Q     Q
17            R   18    R       R     R
18            S   19    S       S     S
19            T   20    T       T     T